Revit 2024 API
ConcreteFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "ConcreteFinish" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ConcreteFinishType
Visual Basic
Public Enumeration ConcreteFinishType
Visual C++
public enum class ConcreteFinishType
Members
Member name | Description
Straight
Curved
Smooth
Polished
Custom
See Also
Autodesk.Revit.DB.Visual Namespace